import React, { useCallback, useContext, useRef, useState } from "react";

import ReactToPrint from "react-to-print";
import { PrinterIcon } from "@heroicons/react/24/outline";
import PageHeaderFooter from "./page-header-footer";
import { SejamContext } from "../../../pages/main";
import moment from "jalali-moment";

export default function OTCFaraBourseTradingRiskAgreement() {
  const [loading, setLoading] = useState(false);
  const { userData } = useContext<any>(SejamContext);

  const componentRef = useRef(null);

  const reactToPrintContent = useCallback(() => {
    return componentRef.current;
  }, [componentRef.current]);

  const reactToPrintTrigger = () => {
    return (
      <button
        className={
          "flex item-center button bg-red-600 w-fit text-white float-left m-5"
        }
      >
        چاپ
        {loading ? (
          <svg className="animate-spin h-5 w-5 mr-3 ..." viewBox="0 0 24 24">
            <circle
              className="opacity-25"
              cx="12"
              cy="12"
              r="10"
              stroke="currentColor"
              stroke-width="4"
            ></circle>
            <path
              className="opacity-75"
              fill="currentColor"
              d="M4 12a8 8 0 018-8V0C5.373 0 0 5.373 0 12h4zm2 5.291A7.962 7.962 0 014 12H0c0 3.042 1.135 5.824 3 7.938l3-2.647z"
            ></path>
          </svg>
        ) : (
          <PrinterIcon className={"h-5 w-5 mr-2"} />
        )}
      </button>
    ); // eslint-disable-line max-len
  };

  return (
    <>
      <ReactToPrint
        content={reactToPrintContent}
        documentTitle="اقرارنامه و بیانیه پذیرش ریسک معاملات سهام و حق تقدم خرید سهام در بازار توافقی فرابورس ایران"
        removeAfterPrint={false}
        trigger={reactToPrintTrigger}
      />
      <div ref={componentRef} className={"mobileAgreement"}>
        <table className={"w-full"} dir={"rtl"}>
          <thead>
            <tr>
              <td>
                <div className="page-header-space">&nbsp;</div>
              </td>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td className={"w-full content"}>
                <div className={"leading-8 text-justify page"}>
                  <div className="text-center">
                    <h4>
                      اقرارنامه و بیانیه پذیرش ریسک معاملات سهام و حق تقدم خرید
                      سهام در بازار توافقی فرابورس ایران
                    </h4>
                  </div>
                  <div className="mt-5">
                    <p>
                      با توجه به ریسک های موجود در معاملات سهام و حق تقدم خرید
                      سهام در بازار توافقی فرابورس ایران، به موجب این اقرارنامه
                      مشتری اذعان می نماید که با اطلاع دقیق و آگاهی کافی در خصوص
                      ماهیت این بازار و نمادهای مندرج در آن، نسبت به معاملات
                      سهام مذکور اقدام می نماید. این اقرارنامه و بیانیه مطابق با
                      ماده 9 `دستورالعامل درج و نحوه انجام معاملات اوراق بهادار
                      در بازار توافقی فرابورس ایران` باید قبل از انجام اولین
                      معامله به امضای مشتری برسد. وفق این سند مشتری اقرار می
                      نماید:{" "}
                    </p>
                  </div>
                  <div className={"mt-12 space-y-2"}>
                    <p>
                      1- از تمامی شرایط، قوانین و مقررات مربوط به انجام معاملات
                      در بازار توافقی فرابورس ایران از جمله دستورالعمل درج و
                      نحوه انجام معاملات اوراق بهادار در بازار توافقی فرابورس
                      ایران و ریسک های مربوط به آن آگاهی دقیق و کامل دارد.
                    </p>
                    <p>
                      2- در صورت عدم وجود قابلیت نقدشوندگی هیچگونه مسئولیتی
                      متوجه فرابورس ایران، کارگزار و ناشر نخواهد بود.
                    </p>
                    <p>
                      3- مطابق با دستورالعمل فوق، سازمان بورس یا فرابورس ایران
                      می تواند دستور توقف نماد معاملاتی را صادر نماید، بازگشایی
                      مجدد نماد تحت شرایطی ممکن است بر سود و زیان مشتری
                      تأثیرگذار باشد.
                    </p>
                    <p>
                      4- آشنایی با مقررات، به مشتری امکان می دهد تا از حقوق و
                      تعهدات خود، آگاهی و پذیرش کامل داشته باشد. مطالعه دقیق
                      اقرارنامه و بیانیه پذیرش ریسک، دستورالعمل فوق و سایر
                      مقررات مرتبط، از الزامات فعالیت در این بازار بوده و
                      کارگزار و فرابورس ایران مسئولیتی در خصوص فقدان آگاهی مشتری
                      نخواهند داشت.
                    </p>
                    <p>
                      5- دامنه نوسان روزانه قیمت و حجم مبنا در معاملات بازار
                      توافقی اعمال نمی شود.
                    </p>
                    <p>
                      6- انجام معاملات به صورت روزانه در بازار توافقی ممنوع است
                      و امکان فروش سهام خریداری شده در روز جاری برای مشتریان
                      وجود ندارد.
                    </p>
                    <p>
                      7- ارسال سفارش تنها از طریق ایستگاه های معاملاتی نامک و
                      صرفاً با اعتبار زمانی روز امکانپذیر است.
                    </p>
                    <p>
                      8- استفاده از اعتبار برای خرید سهام و حق تقدم سهام در
                      نمادهای معاملاتی اوراق بهادار ناشر بازار توافقی یا تخصیص
                      اعتبار بر مبنای سهام ناشر بازار توافقی مجاز نیست.
                    </p>
                    <p>
                      9- ورود هر سفارش در سمت خرید بایستی با رعایت نصاب های
                      مندرج در دستورالعمل و مقررات مربوط به آن صورت گیرد.
                    </p>
                    <p>
                      10- در صورت تشخیص کارگزار یا معامله گر به بروز تخلف در
                      درخواست های سفارش ارسال به وی، کارگزار یا معامله گر مکلف
                      به عدم ثبت سفارش مذکور در سامانه معاملات است.
                    </p>
                    <p>
                      11- در بازار توافقی، انتشار قراردادهای آتی، اختیار معامله
                      و اختیار فروش تبعی بر مبنای سهام درج شده در آن و انجام
                      فروش تعهدی امکان پذیر نیست.
                    </p>
                    <p>
                      12- کلیه ریسک های ذکر نشده ای که به هر نحو مربوط به انجام
                      معاملات سهام و حق تقدم خرید سهام یا سایر موضوعات در بازار
                      توافقی فرابورس ایران می باشد و مشتری به همه آن ها اشعار
                      کامل دارد مشمول این اقرارنامه و بیانیه خواهد شد. به عبارت
                      دیگر، مراتب فوق جنبه حصری ندارد.
                    </p>
                    <p>
                      13- مشتری متعهد میگردد که مفاد تمامی قوانین و مقررات و
                      دستورالعمل های لازم الاجرا در بازار سرمایه اعم از قانون
                      بازار اوراق بهادار جمهوری اسلامی ایران را در خصوص بازار
                      توافقی فرابورس ایران رعایت نموده و چنانچه در هر زمان بنا
                      به تشخیص و اعلام مراجه ذی صلاح بازار سرمایه هرگونه تخلف،
                      قصور یا کوتاهی در رعایت مفاد مذکور از سوی مشتری اعلام شود
                      آن مرجع ذیربط حق دارد ضمن ممانعت از انجام معاملات مشتری،
                      مطابق با قوانین مربوطه اعم از جرایم و مجازات های موضوع فصل
                      ششم قانون بازار اوراق بهادار جمهوری اسلامی ایران با وی
                      برخورد نماید.
                    </p>
                    <p>
                      14- به موجب این سند اینجانب{" "}
                      <span className="font-bold">
                        {userData?.privatePerson?.firstName +
                          " " +
                          userData?.privatePerson?.lastName}
                      </span>{" "}
                      اقرارنامه و بیانیه پذیرش ریسک معاملات سهام و حق تقدم خرید
                      سهام در بازار توافقی و همچنین مفاد دستورالعمل درج و نحوه
                      انجام معاملات اوراق بهادار در بازار توافقی فرابورس ایران{" "}
                      <span className="mx-1">
                        در تاریخ {moment().locale("fa").format("YYYY/MM/DD")}
                      </span>
                      را دریافت و مطالعه نموده و ضمن اعلام اطلاع از کلیه مقررات
                      و شرایط معاملاتی و ریسک هایی که در آن متصور بوده و احتمال
                      وقوع دارد و نیز با شناخت و درک کامل از ماهیت امر و شرایط و
                      مقررات مربوطه، مراتب را تأیید نموده و هیچ گونه اعتراض و
                      ادعایی اعم از حقوقی و جزایی در حال حاضر یا بعداً در این
                      خصوص علیه سایر اشخاص نداشته، حق دعوی خود را در این زمینه
                      علی الدوام سلب و ساقط می سازم.
                    </p>
                  </div>
                </div>
              </td>
            </tr>
          </tbody>
          <tfoot>
            <tr>
              <td>
                <div className="page-footer-space">&nbsp;</div>
              </td>
            </tr>
          </tfoot>
        </table>
        <PageHeaderFooter />
      </div>
    </>
  );
}
